Revit 2024 API
StructuralSectionAnalysisParams.MomentOfInertiaWeakAxis Property
 Moment of Inertia about main weak axis (I).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double MomentOfInertiaWeakAxis { get; set; }
Visual Basic
Public Property MomentOfInertiaWeakAxis As Double
	Get
	Set
Visual C++
public:
property double MomentOfInertiaWeakAxis {
	double get ();
	void set (double value);
}
See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace